
f4Rules = f4Rules or {}
f4Rules.orderedCategoriesRules = f4Rules.orderedCategoriesRules or {}

f4Rules = {
    ['ОСНОВНЫЕ ПРАВИЛА'] = {
        '1.1 | Заходя на сервер, Вы соглашаетесь со всеми правилами, написанные ниже. Незнание их не освобождает Вас от ответственности.',
        '1.2 | Основатели проекта c рангом "root", а также глава наборного персонала с рангом "superadmin" имеют право не соблюдать данные правила и выносить вердикт в не соответствии с данными правилами. А именно SuperAdmin / root в праве выдать наказание на своё усмотрение не указывая причину или используя пункт данного правила!',
        '1.3 | Нарушение правил наказывается в соответствии с таблицей наказаний. Если в таблице нет наказания за конкретное нарушение — администрация выносит вердикт на своё усмотрение.',
    },
    ['НЕ ОСНОВНЫЕ ПРАВИЛА'] = {
        '1.1 | Заходя на сервер, Вы соглашаетесь со всеми правилами, написанные ниже. Незнание их не освобождает Вас от ответственности.',
    },
    ['СУПЕР НЕ ОСНОВНЫЕ ПРАВИЛА'] = {
        '1.1 | Заходя на сервер, Вы соглашаетесь со всеми правилами, написанные ниже. Незнание их не освобождает Вас от ответственности.',
        '1.2 | Основатели проекта c рангом "root", а также глава наборного персонала с рангом "superadmin" имеют право не соблюдать данные правила и выносить вердикт в не соответствии с данными правилами. А именно SuperAdmin / root в праве выдать наказание на своё усмотрение не указывая причину или используя пункт данного правила!',
    },
}

f4Rules.orderedCategoriesRules = {
    'ОСНОВНЫЕ ПРАВИЛА',
    'НЕ ОСНОВНЫЕ ПРАВИЛА',
    'СУПЕР НЕ ОСНОВНЫЕ ПРАВИЛА',
}
