-- СПАСИБО ЧТО СКАЧАЛ МОЙ КОНФИГ
-- НАДЕЮСЬ ПОМОГ
-- ДЕЛАЛ КОНФИГ ДЛЯ СЕРВЕРА REVERSE RP https://discord.gg/hh2VEx9Y69
rp.cfg.Doors = {
	-- team doors +
	{
		Name = 'Админ Зона',
		Teams = { TEAM_ADMIN },
		MapIDs = { 3220 }
	},
	{
		Name = 'Полицейский участок',
		Teams = { TEAM_POLICE, TEAM_CHIEF, TEAM_MAYOR, TEAM_FBR, TEAM_SWAT, TEAM_SWATLEADER },
		Locked = true,
		MapIDs = { 1657, 2967, 2593, 1665, 1666, 3119, 3120, 3121, 3122, 2596, 2595 }
	},
	{
		Name = 'Мэрия',
		Teams = { TEAM_MAYOR, TEAM_POLICE, TEAM_CHIEF, TEAM_FBR, TEAM_SWAT, TEAM_SWATLEADER },
		Locked = true,
		MapIDs = { 3225, 3226, 2582, 2583, 2634, 2590, 2589, 2592, 2591, 3358, 3359 }
	},
	{
		Name = 'Тюрьма',
		Teams = { TEAM_POLICE, TEAM_CHIEF, TEAM_MAYOR, TEAM_FBR, TEAM_SWAT, TEAM_SWATLEADER },
		Locked = true,
		MapIDs = { 1938, 1937, 1936, 2584, 2585, 2616, 2615, 2588 }
	},
	{
		Name = 'Банк',
		Teams = { TEAM_BANK },
		MapIDs = { 3097, 3096, 3099, 3098, 3079, 3080, 3077, 3078, 3082 }
	},
	-- Склады/Заводы +
	{
		Name = 'Склад #1',
		MapIDs = { 1354, 1353, 1465 }
	},
	{
		Name = 'Склад #2',
		MapIDs = { 1371, 1373, 1356, 1355, 1406, 1407, 1562, 1561 }
	},
	{
		Name = 'Склад #3',
		MapIDs = { 1563, 1564, 1565, 1680 }
	},
	{
		Name = 'Склад #4',
		MapIDs = { 1790, 1789, 1798 }
	},
	{
		Name = 'Склад #5.',
		MapIDs = { 2212, 2211, 2210 }
	},
	{
		Name = 'Склад #6',
		MapIDs = { 1586, 1585, 1872, 1588 }
	},
	{
		Name = 'Склад #7.',
		MapIDs = { 3395, 3396 }
	},
	{
		Name = 'Склад #8',
		MapIDs = { 3398, 3397}
	},
	{
		Name = 'Завод #1',
		MapIDs = { 2165, 2173, 2085 }
	},
	{
		Name = 'Завод #2',
		MapIDs = { 2732, 2775, 2774, 2773 }
	},
	{
		Name = 'Завод #3',
		MapIDs = { 2043, 2042, 2077, 3546, 2082, 3346, 2079, 3347 }
	},
	{
		Name = 'Завод #4',
		MapIDs = { 2046, 2044, 2045, 2083 }
	},
	{
		Name = 'Завод #5',
		MapIDs = { 3517, 3516, 3518 }
	},
	-- Cinema +
	{
		Name = 'Кинотеатр',
		MapIDs = { 1963, 1962, 1986, 1987, 1989, 1990 }
	},
	-- Baltic +
	{
		Name = 'Кафе Baltic',
		MapIDs = { 1601, 1416 }
	},
	-- Магазины/Бары +
	{
		Name = 'Бар #1',
		MapIDs = { 1469, 1468, 1854 }
	},
	{
		Name = 'Магазин #1',
		MapIDs = { 1391, 1393, 1392, 1858 }
	},
	{
		Name = 'Магазин #2',
		MapIDs = { 1385, 1390 }
	},
	{
		Name = 'Магазин #3',
		MapIDs = { 1930, 2120, 2119, 1935 }
	},
	{
		Name = 'Магазин #4',
		MapIDs = { 3994, 3993, 3385 }
	},
	{
		Name = 'Магазин #5',
		MapIDs = { 1479, 1478, 1480 }
	},
	{
		Name = 'Магазин #6',
		MapIDs = { 2707, 2706, 2667 }
	},
	-- Pelco +
	{
		Name = 'Pelco',
		MapIDs = { 1905 }
	},
	-- Помещения
	{
		Name = 'Помещение #1',
		MapIDs = { 1600, 1615, 1616 } -- +
	},
	{
		Name = 'Помещение #2',
		MapIDs = { 2168, 2172 } -- +
	},
	{
		Name = 'Помещение #3',
		MapIDs = { 2246, 2142, 2195, 3523 }
	},
	{
		Name = 'Помещение #4',
		MapIDs = { 2114, 1985, 2115 }
	},
	{
		Name = 'Помещение #5',
		MapIDs = { 2118, 2121 }
	},
	{
		Name = 'Помещение #6',
		MapIDs = { 2642, 2647, 2703, 2646, 2653 }
	},
	{
		Name = 'Коттедж #1',
		MapIDs = { 1691, 1689, 1686, 1690, 1688, 1684, 1685, 1723, 1724, 1738, 1737 }
	},
	{
		Name = 'Помещение #7',
		MapIDs = { 1399, 2158 }
	},
	{
		Name = 'Помещение #8',
		MapIDs = { 2163, 2164, 2175, 2176 }
	},
	{
		Name = 'Помещение #9',
		MapIDs = { 2304, 2303 }
	},
	{
		Name = 'Помещение #10',
		MapIDs = { 1743, 1744, 1745, 1746, 1747 }
	},
	{
		Name = 'Помещение #11',
		MapIDs = { 1860, 1862, 1861, 1863 }
	},
	{
		Name = 'Помещение #12',
		MapIDs = { 1786, 1758 }
	},
	{
		Name = 'Помещение #13',
		MapIDs = { 1763, 1765, 1764 }
	},
	{
		Name = 'Помещение #14',
		MapIDs = { 1584, 1667 }
	},
	{
		Name = 'Помещение #15',
		MapIDs = { 1607 }
	},
	{
		Name = 'Помещение #16',
		MapIDs = { 1613 }
	},
	{
		Name = 'Помещение #17',
		MapIDs = { 1614 }
	},
	{
		Name = 'Помещение #18',
		MapIDs = { 3442, 3443 }
	},
	{
		Name = 'Помещение #19',
		MapIDs = { 3158, 3159, 3106, 3107, 3105, 3104 }
	},
	{
		Name = 'Помещение #20',
		MapIDs = { 1266, 1265, 1268, 1267 }
	},
	{
		Name = 'Помещение #21',
		MapIDs = { 2566, 2573 }
	},
	{
		Name = 'Церковь',
		MapIDs = { 2840, 2839, 2835 }
	},
	{
		Name = 'Помещение #22',
		MapIDs = { 2538, 2540, 2563 }
	},
	{
		Name = 'Помещение #23',
		MapIDs = { 3580, 3581 }
	},
	{
		Name = 'Помещение #24',
		MapIDs = { 2333, 2334 }
	},
	{
		Name = 'Помещение #25',
		MapIDs = { 2371, 2370, 2361, 2362, 2360, 2369, 2368 }
	},
	{
		Name = 'Помещение #26',
		MapIDs = { 2131, 2136 }
	},
	{
		Name = 'Помещение #27',
		MapIDs = { 3025, 3024 }
	},
	{
		Name = 'Помещение #28',
		MapIDs = { 3027, 3026 }
	},
	{
		Name = 'Помещение #29',
		MapIDs = { 3028, 3029 }
	},
	{
		Name = 'Помещение #30',
		MapIDs = { 3000, 2999, 2997 }
	},
	{
		Name = 'Помещение #31',
		MapIDs = { 2977, 2972, 2971, 2969, 2968, 2970 }
	},
	{
		Name = 'Помещение #32',
		MapIDs = { 2980, 2981, 2982, 2993, 2992 }
	},
	{
		Name = 'Помещение #33',
		MapIDs = { 3473 }
	},
	{
		Name = 'Помещение #34',
		MapIDs = { 2995 }
	},
	{
		Name = 'Помещение #35',
		MapIDs = { 3430, 3429 }
	},
	{
		Name = 'Помещение #36',
		MapIDs = { 3417, 3416 }
	},
	{
		Name = 'Клуб',
		MapIDs = { 3157, 3152, 3153, 3131, 3127 }
	},
	-- hotel doors +
	{
		Name = 'Отель Элион',
		Teams = { TEAM_HOTEL },
		MapIDs = { 1467, 1466, 1461, 1476 }
	},
	{
		Name = 'Номер #1',
		MapIDs = { 1447, 2100, 2098 }
	},
	{
		Name = 'Номер #2',
		MapIDs = { 1445, 1440 }
	},
	{
		Name = 'Номер #3',
		MapIDs = { 1440, 1445 }
	},
	{
		Name = 'Номер Люкс',
		MapIDs = { 2096, 1453, 1560, 1448 }
	},
	-- obshaga doors +
	{
		Name = 'Общежитие',
		Teams = {},
		MapIDs = { 1801, 1803}
	},
	{
		Name = 'Комната #1',
		MapIDs = { 1813 }
	},
	{
		Name = 'Комната #2',
		MapIDs = { 1814 }
	},
	{
		Name = 'Комната #3',
		MapIDs = { 1812 }
	},
	{
		Name = 'Комната #4',
		MapIDs = { 1808 }
	},
	{
		Name = 'Комната #5',
		MapIDs = { 1891 }
	},
	{
		Name = 'Комната #6',
		MapIDs = { 1806 }
	},
	{
		Name = 'Комната #7',
		MapIDs = { 1807 }
	},
	{
		Name = 'Комната #8',
		MapIDs = { 1805, 1804 }
	},
	-- 
	{
		Name = 'Дом #1',
		MapIDs = { 2247, 2248, 2458 }
	},
	{
		Name = 'Дом #2',
		MapIDs = { 1924, 1907, 1908, 1961 }
	},
	{
		Name = 'Авто-Мастерская',
		MapIDs = { 3294, 3477, 3295, 3284, 3285 }
	},
	{
		Name = 'Дом #3',
		MapIDs = { 1243, 1255 }
	},
	{
		Name = 'Дом #4',
		MapIDs = { 1240, 1244 }
	},
	{
		Name = 'Дом #5',
		MapIDs = { 1241, 1236 }
	},
	{
		Name = 'Дом #6',
		MapIDs = { 1252, 1249, 1250, 1251, 1247, 1246 } -- +
	},
	{
		Name = 'Дом #7',
		MapIDs = { 2296, 2297 }
	},
	-- 
	{
		Name = 'Квартира #1',
		MapIDs = { 1530, 1497 }
	},
	{
		Name = 'Квартира #2',
		MapIDs = { 1498, 1507 }
	},
	{
		Name = 'Квартира #3',
		MapIDs = { 1481, 1508 }
	},
	{
		Name = 'Квартира #4',
		MapIDs = { 1482, 1532 }
	},
	{
		Name = 'Квартира #5',
		MapIDs = { 1916, 1921, 1920 }
	},
	{
		Name = 'Квартира #6',
		MapIDs = { 1917, 1909 }
	},
	{
		Name = 'Квартира #7',
		MapIDs = { 1912, 1910, 1911 }
	},
	{
		Name = 'Квартира #8',
		MapIDs = { 1915, 1914, 1913 }
	},
	{
		Name = 'Квартира #9',
		MapIDs = { 2442, 2447 }
	},
	{
		Name = 'Квартира #10',
		MapIDs = { 2443, 2448 }
	},
	{
		Name = 'Квартира #11',
		MapIDs = { 2450, 2455 }
	},
	{
		Name = 'Квартира #12',
		MapIDs = { 2451, 2456 }
	},
	{
		Name = 'Квартира #13',
		MapIDs = { 2441, 2446 }
	},
	{
		Name = 'Квартира #14',
		MapIDs = { 2444, 2445 }
	},
	{
		Name = 'Квартира #15',
		MapIDs = { 2449, 2454 }
	},
	{
		Name = 'Квартира #16',
		MapIDs = { 2452, 2453 }
	},
	{
		Name = 'Квартира #17',
		MapIDs = { 2876, 2899 }
	},
	{
		Name = 'Квартира #18',
		MapIDs = { 2875, 2897 }
	},
	{
		Name = 'Квартира #19',
		MapIDs = { 2877, 2895 }
	},
	{
		Name = 'Квартира #20',
		MapIDs = { 2878, 2893 }
	},
	{
		Name = 'Квартира #21',
		MapIDs = { 2861, 2891 }
	},
	{
		Name = 'Квартира #22',
		MapIDs = { 2860, 2889 }
	},
	{
		Name = 'Квартира #23',
		MapIDs = { 2862, 2887 }
	},
	{
		Name = 'Квартира #24',
		MapIDs = { 2863, 2885 }
	},
	{
		Name = 'Квартира #25',
		MapIDs = { 2376, 2846 }
	},
	{
		Name = 'Квартира #26',
		MapIDs = { 2375, 2848 }
	},
	{
		Name = 'Квартира #27',
		MapIDs = { 2374, 2850 }
	},
	{
		Name = 'Квартира #28',
		MapIDs = { 2377, 2852 }
	},
	{
		Name = 'Квартира #29',
		MapIDs = { 2378, 2854 }
	},
	{
		Name = 'Квартира #30',
		MapIDs = {2379, 2856   }
	},
	{
		Name = 'Коттедж #2',
		MapIDs = { 3260, 3259, 3246, 3245, 3249, 3250, 3254, 3253, 3255, 3256, 3265, 3266, 3262, 3261, 3268, 3263, 3264, 3269, 3258, 3257, 3873, 3267, 3248, 3247, 3273, 3272}
	},
	{
        Name = '',
		Teams = {},
		Locked = false,
		MapIDs = { 2843, 3600, 2613, 1477, 2820, 1435, 1590, 1431, 1432, 1451, 1452, 1450, 1449, 3524, 1722, 1918, 1919, 2372, 2373, 2858, 2859, 2845	}
	},
}